Architecture model: 
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 28, 28, 32)        320       
                                                                 
 batch_normalization (BatchN  (None, 28, 28, 32)       128       
 ormalization)                                                   
                                                                 
 conv2d_1 (Conv2D)           (None, 28, 28, 32)        9248      
                                                                 
 batch_normalization_1 (Batc  (None, 28, 28, 32)       128       
 hNormalization)                                                 
                                                                 
 conv2d_2 (Conv2D)           (None, 14, 14, 32)        25632     
                                                                 
 batch_normalization_2 (Batc  (None, 14, 14, 32)       128       
 hNormalization)                                                 
                                                                 
 dropout (Dropout)           (None, 14, 14, 32)        0         
                                                                 
 conv2d_3 (Conv2D)           (None, 14, 14, 64)        18496     
                                                                 
 batch_normalization_3 (Batc  (None, 14, 14, 64)       256       
 hNormalization)                                                 
                                                                 
 conv2d_4 (Conv2D)           (None, 14, 14, 64)        36928     
                                                                 
 batch_normalization_4 (Batc  (None, 14, 14, 64)       256       
 hNormalization)                                                 
                                                                 
 conv2d_5 (Conv2D)           (None, 7, 7, 64)          102464    
                                                                 
 batch_normalization_5 (Batc  (None, 7, 7, 64)         256       
 hNormalization)                                                 
                                                                 
 dropout_1 (Dropout)         (None, 7, 7, 64)          0         
                                                                 
 flatten (Flatten)           (None, 3136)              0         
                                                                 
 dense (Dense)               (None, 64)                200768    
                                                                 
 batch_normalization_6 (Batc  (None, 64)               256       
 hNormalization)                                                 
                                                                 
 dropout_2 (Dropout)         (None, 64)                0         
                                                                 
 dense_1 (Dense)             (None, 9)                 585       
                                                                 
=================================================================
Total params: 395,849
Trainable params: 395,145
Non-trainable params: 704
_________________________________________________________________

Result training:
Accuracy: [0.713628888130188, 0.9441707730293274, 0.9633278846740723, 0.9703338742256165, 0.9772851467132568, 0.9787629842758179, 0.9806239604949951, 0.9837985634803772, 0.983415424823761, 0.9859879612922668, 0.9858237504959106, 0.9870279431343079, 0.9877942204475403, 0.9893267750740051, 0.989819347858429, 0.9885604977607727, 0.989819347858429, 0.9909140467643738, 0.99064040184021, 0.9918445348739624, 0.9922276735305786, 0.99085932970047, 0.9922276735305786, 0.9920634627342224, 0.9926108121871948, 0.994033932685852, 0.9928845167160034, 0.9936507940292358, 0.9928845167160034, 0.9939792156219482]
Loss: [0.9067041277885437, 0.1808857023715973, 0.1252240091562271, 0.09914181381464005, 0.07823953032493591, 0.07087105512619019, 0.06135791167616844, 0.053602032363414764, 0.056699059903621674, 0.04845783859491348, 0.04507119581103325, 0.04305361956357956, 0.03968226909637451, 0.03574952110648155, 0.03432764112949371, 0.0356748104095459, 0.03540973365306854, 0.03158273175358772, 0.02989393286406994, 0.02901020273566246, 0.02586618810892105, 0.031245533376932144, 0.026160627603530884, 0.026902709156274796, 0.026873642578721046, 0.024375975131988525, 0.02530256286263466, 0.02274453081190586, 0.024338601157069206, 0.021760253235697746]
Validation accuracy): [0.9169859290122986, 0.9620689749717712, 0.9767560958862305, 0.9817368984222412, 0.9841634631156921, 0.9840357303619385, 0.9819923639297485, 0.9799489378929138, 0.9874840378761292, 0.9872286319732666, 0.9881225824356079, 0.9883780479431152, 0.9883780479431152, 0.9896551966667175, 0.9882503151893616, 0.9818646311759949, 0.9841634631156921, 0.9896551966667175, 0.9878671765327454, 0.9863346219062805, 0.9893997311592102, 0.9831417798995972, 0.9902937412261963, 0.9900383353233337, 0.9901660084724426, 0.9905491471290588, 0.9900383353233337, 0.9895274639129639, 0.9897828698158264, 0.9891443252563477]
Validation loss): [0.27211588621139526, 0.11564464122056961, 0.07028496265411377, 0.058444444090127945, 0.04995586723089218, 0.05067971348762512, 0.06159751117229462, 0.0679909959435463, 0.038081854581832886, 0.042292270809412, 0.04258798062801361, 0.037743985652923584, 0.04291160777211189, 0.03648967668414116, 0.04343334585428238, 0.06141171604394913, 0.05833541974425316, 0.040509216487407684, 0.04899589344859123, 0.05928551405668259, 0.04732801020145416, 0.07152720540761948, 0.046478450298309326, 0.0420154333114624, 0.043218426406383514, 0.04445071518421173, 0.044431690126657486, 0.0497094988822937, 0.04543561115860939, 0.06058479845523834]
