Architecture model: 
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 28, 28, 32)        320       
                                                                 
 batch_normalization (BatchN  (None, 28, 28, 32)       128       
 ormalization)                                                   
                                                                 
 conv2d_1 (Conv2D)           (None, 28, 28, 32)        9248      
                                                                 
 batch_normalization_1 (Batc  (None, 28, 28, 32)       128       
 hNormalization)                                                 
                                                                 
 conv2d_2 (Conv2D)           (None, 14, 14, 32)        25632     
                                                                 
 batch_normalization_2 (Batc  (None, 14, 14, 32)       128       
 hNormalization)                                                 
                                                                 
 dropout (Dropout)           (None, 14, 14, 32)        0         
                                                                 
 flatten (Flatten)           (None, 6272)              0         
                                                                 
 dense (Dense)               (None, 64)                401472    
                                                                 
 batch_normalization_3 (Batc  (None, 64)               256       
 hNormalization)                                                 
                                                                 
 dropout_1 (Dropout)         (None, 64)                0         
                                                                 
 dense_1 (Dense)             (None, 2)                 130       
                                                                 
=================================================================
Total params: 437,442
Trainable params: 437,122
Non-trainable params: 320
_________________________________________________________________

Result training:
Accuracy: [0.9875418543815613, 0.9970399141311646, 0.9974002838134766, 0.9973745346069336, 0.9972715377807617, 0.9981724619865417, 0.9982239603996277, 0.9980695247650146, 0.9981724619865417, 0.9982239603996277, 0.9982753992080688, 0.9982753992080688, 0.9983011484146118, 0.9985585808753967, 0.9984555840492249, 0.9982753992080688, 0.9985842704772949, 0.9988417029380798, 0.9988932013511658, 0.9987644553184509, 0.9986615180969238, 0.9988417029380798, 0.998918890953064, 0.9988417029380798, 0.9990218877792358, 0.9989703893661499, 0.9988417029380798, 0.9989446401596069, 0.9988159537315369, 0.9987387657165527]
Loss: [0.0393141470849514, 0.01174994744360447, 0.01165835652500391, 0.010739803314208984, 0.010535004548728466, 0.008992299437522888, 0.00797878298908472, 0.00909182708710432, 0.0073218331672251225, 0.007944050244987011, 0.006410815287381411, 0.007702560629695654, 0.007434164639562368, 0.006374893710017204, 0.007056152448058128, 0.007093079388141632, 0.006560068577528, 0.005634509027004242, 0.005955232307314873, 0.005932456813752651, 0.005887456238269806, 0.004720295313745737, 0.006121284328401089, 0.00717205973342061, 0.005195253062993288, 0.005237969569861889, 0.0069811162538826466, 0.005555266514420509, 0.006344806402921677, 0.0060196323320269585]
Validation accuracy): [0.9678678512573242, 0.9986186027526855, 0.9981381297111511, 0.9985585808753967, 0.9985585808753967, 0.9984984993934631, 0.998918890953064, 0.9974774718284607, 0.99909907579422, 0.9982582330703735, 0.9988588690757751, 0.9988588690757751, 0.9990390539169312, 0.9986186027526855, 0.9982582330703735, 0.9989789724349976, 0.9986786842346191, 0.998918890953064, 0.999279260635376, 0.999279260635376, 0.9989789724349976, 0.9989789724349976, 0.998918890953064, 0.9987987875938416, 0.9992192387580872, 0.9988588690757751, 0.9991591572761536, 0.9989789724349976, 0.9993393421173096, 0.999279260635376]
Validation loss): [0.08894722908735275, 0.0050183553248643875, 0.004081827122718096, 0.005428878124803305, 0.0046396758407354355, 0.004721668548882008, 0.0030505673494189978, 0.010681765154004097, 0.0035059398505836725, 0.005067809950560331, 0.005970104597508907, 0.004703586921095848, 0.0020758630707859993, 0.00745612196624279, 0.0038332927506417036, 0.0038718737196177244, 0.003112349659204483, 0.006176150869578123, 0.0021310134325176477, 0.0026605678722262383, 0.0030206702649593353, 0.002170633990317583, 0.0035368420649319887, 0.0032437785994261503, 0.004262140486389399, 0.0029033110477030277, 0.0035138078965246677, 0.004637825768440962, 0.002668999833986163, 0.0030259029008448124]
